/********************************************************************************************
@author Bevis
@date 2018-09-03

********************************************************************************************/
#ifndef __BV_TIME_H__
#define __BV_TIME_H__

#include <bv_common.h>

typedef unsigned long BV_TIME_HANDLE;
#define BV_TIME_INFO_LENGTH 21 //时间信息的长度(不包含'\0')
#define BV_TIME_NUM_LENGTH 14//20180907204600 年月日时分秒

/********************************************************************************************
@函数名称:
bv_time_get

@函数功能:
获取当前时间

@函数参数:
无

@函数返回值
示例：
[2018-09-03 23:27:02]

********************************************************************************************/
char* bv_time_get(void);

/********************************************************************************************
@函数名称:
bv_time_get_num

@函数功能:
获取当前时间,返回时全数字串

@函数参数:
无

@函数返回值
示例：
201809032327

********************************************************************************************/
char* bv_time_get_num(void);


/********************************************************************************************
@函数名称:
bv_time_ms_start

@函数功能:
毫秒(ms)计时开始，配合bv_time_ms_end使用。

@函数参数:
无

@函数返回值
成功：时间句柄(非0值)
失败：返回0
********************************************************************************************/
BV_TIME_HANDLE bv_time_ms_start(void);

/********************************************************************************************
@函数名称:
bv_time_ms_end

@函数功能:
毫秒(ms)计时结束，配合bv_time_ms_start使用。

@函数参数:
无

@函数返回值
返回距离计时开始时的时间长度。单位(ms)
********************************************************************************************/
unsigned int bv_time_ms_end(BV_TIME_HANDLE timeHandle);

/********************************************************************************************
@函数名称:
bv_time_us_start

@函数功能:
微妙(us)计时开始，配合bv_time_us_end使用。

@函数参数:
无

@函数返回值
成功：时间句柄(非0值)
失败：返回0
********************************************************************************************/
BV_TIME_HANDLE bv_time_us_start(void);

/********************************************************************************************
@函数名称:
bv_time_us_end

@函数功能:
微妙(us)计时结束，配合bv_time_us_start使用。

@函数参数:
无

@函数返回值
返回距离计时开始时的时间长度。单位(us)
********************************************************************************************/
unsigned int bv_time_us_end(BV_TIME_HANDLE timeHandle);

/********************************************************************************************
@函数名称:
bv_time_ns_start

@函数功能:
纳秒(ns)计时开始，配合bv_time_ns_end使用。

@函数参数:
无

@函数返回值
成功：时间句柄(非0值)
失败：返回0
********************************************************************************************/
BV_TIME_HANDLE bv_time_ns_start(void);

/********************************************************************************************
@函数名称:
bv_time_ns_end

@函数功能:
纳秒(ns)计时结束，配合bv_time_ns_start使用。

@函数参数:
无

@函数返回值
返回距离计时开始时的时间长度。单位(ns)
********************************************************************************************/
unsigned int bv_time_ns_end(BV_TIME_HANDLE timeHandle);


#endif //__BV_TIME_H__



